Autodesk.Revit.DB.ParameterFilterElement.Create(Autodesk.Revit.DB.Document,System.String,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementFilter)
Creates a new ParameterFilterElement in the given document.
aDocument:
The document in which to create the ParameterFilterElement.
name:
The user-visible name for the new ParameterFilterElement.
categories:
The categories for the new ParameterFilterElement.
elementFilter:
The rules for the new ParameterFilterElement, represented as an ElementFilter.
ElementFilter is either an ElementParameterFilter or an ElementLogicalFilter
representing a Boolean combination of ElementParameterFilters. In addition, we check that
each ElementParameterFilter satisfies the following conditions:
Its array of FilterRules is not empty and contains:
Any number of FilterRules of type FilterValueRule, FilterInverseRule, and SharedParameterApplicableRule or Exactly one FilterCategoryRule containing only one category from categories stored by this ParameterFilterElement or Exactly two rules: the first one is a FilterCategoryRule containing only one category from categories stored by this ParameterFilterElement and
the second one is a FilterRule of type FilterValueRule, FilterInverseRule, or SharedParameterApplicableRule.
Note that cases in the second and third bullet are currently allowed only if the parent node of ElementParameterFilter is LogicalOrFilter.
Returns:
A pointer to the new ParameterFilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
The given value for name is already in use as a filter element name.
-or-
One of the given rules refers to a parameter that does not apply to this filter's categories.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The ElementFilter is not acceptable for use by a ParameterFilterElement.
Since:
2019

Autodesk.Revit.DB.ParameterFilterElement.Create(Autodesk.Revit.DB.Document,System.String,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Creates a new ParameterFilterElement in the given document.
aDocument:
The document in which to create the ParameterFilterElement.
name:
The user-visible name for the new ParameterFilterElement.
categories:
The categories for the new ParameterFilterElement.
Returns:
A pointer to the new ParameterFilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
The given value for name is already in use as a filter element name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011